package core.basesyntax;

// Якщо користувач повністю вгадав кінцевий рахунок гри, тобто result1 == bet1 і result2 == bet2,
// то за умовою задачі, повертається 2;
// Якщо результат першої команди більший, ніж результат другої і ставка на перемогу першої команди
// також більша,
// то повертаємо 1. Аналогічно щодо другої команди. Тобто, якщо результат другої команди більший,
// ніж результат першої і ставка на перемогу другої команди також більша повертаємо 1
// Треба врахувати випадок нічиї. Якщо result1 == result2 і bet1 == bet2, то також повертаємо 1.
// У решті випадків 0.

public class FootballMatch {
    public int matchResult(int result1, int result2, int bet1, int bet2) {
        return (result1 == bet1 && result2 == bet2) ? 2 :
                (result1 > result2 && bet1 > bet2)
                        || (result1 < result2 && bet1 < bet2)
                        || (result1 == result2 && bet1 == bet2) ? 1 : 0;

    }
}
